1_2/modules/saaj/test-resources/soap-part.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <shw:Hello xmlns:shw="http://www.jcommerce.net/soap/ns/SOAPHelloWorld">
            <shw:Myname>Tony</shw:Myname>
        </shw:Hello>
    </soapenv:Header>
    <soapenv:Body>
        <shw:Address shw:t='test' xmlns:shw="http://www.jcommerce.net/soap/ns/SOAPHelloWorld">
            <shw:City>GENT</shw:City>
        </shw:Address>
    </soapenv:Body>
</soapenv:Envelope>